Revit 2027 API
ParameterTypeId.RebarSystemHookOrientFrontDirn2 Property
 "Exterior Minor Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookOrientFrontDirn2 { get; }
Public Shared ReadOnly Property RebarSystemHookOrientFrontDirn2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookOrientFrontDirn2 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookOrientFrontDirn2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace